Repository: leka/ios-monorepo
Catalog: Apps/LekaUpdater/Resources/ll10n/Localizable.xcstrings
Source language: en
Languages: fr

# connection.another_robot
source: Disconnect and connect another robot
fr: Se déconnecter et choisir un autre robot

# connection.new_robot
source: Connect to your robot
fr: Se connecter à un robot

# general.no
source: No
fr: Non

# general.yes
source: Yes
fr: Oui

# information.changelog_disclosure_title
source: Changelog
fr: Liste des changements apportés

# information.changelog_not_found_text
source: Changelog is not available
fr: La liste des changements n'est pas disponbile

# information.changelog_section_title
source: New features
fr: Nouveautés

# information.robot.battery
source: Battery: %@
fr: Batterie : %@

# information.robot.charging_status
source: Charging: %@
fr: En charge : %@

# information.robot.serial_number
source: Serial Number: %@
fr: Numéro de série : %@

# information.start_update_button
source: Start robot update
fr: Lancer la mise à jour du robot

# information.status.alert.robot_not_in_charge
source: ⚠️ WARNING ⚡ The robot is no longer in charge
fr: ⚠️ ATTENTION ⚡ Le robot n'est plus en charge

# information.status.alert.robot_not_in_charge_button
source: Please put Leka back on its charging station and/or check it's plugged to a power outlet
fr: Veuillez reposer Leka sur sa base et/ou vérifier le branchement

# information.status.robot_cannot_be_updated_text
source: ⚠️ DEV 🚧 Update process not recognized or not available (Error code: #0003)
fr: ⚠️ DEV 🚧 Processus de mise à jour non reconnu ou inexistant (Code erreur #0003)

# information.status.robot_is_up_to_date
source: 🤖 Your robot is up-to-date! 🎉 You're all done 👌
fr: 🤖 Votre robot est à jour ! 🎉 Vous n'avez rien à faire 👌

# information.status.robot_not_connected
source: 🤖 No robot connected 🚫
fr: 🤖 Aucun robot connecté 🚫

# information.status.robot_update_available
source: ⬆️ New firmware update available 📦
fr: ⬆️ Une mise à jour est disponible 📦

# main.app_description
source: The app to update your Leka robots!
fr: L'application pour mettre à jour vos robots Leka !

# update.error.back_to_connection_button_label
source: Return to robot connection page
fr: Retour à la page de connexion

# update.error.check_update_button_label
source: Check for updates
fr: Vérifier les mises à jour

# update.error.close_button_label
source: Close
fr: Fermer

# update.error.failed_to_load_file_description
source: Error code #0001: Robot update file cannot be opened
fr: Code erreur #0001: Le fichier de mise à jour du robot ne peut pas être ouvert

# update.error.failed_to_load_file_instructions
source: Ensure your app is up to date
fr: Vérifier que votre application est à jour

# update.error.robot_not_up_to_date_description
source: Error code #0002: Update failed
fr: Code erreur #0002: Echec de la mise à jour

# update.error.robot_not_up_to_date_instructions
source: Reconnect the robot and restart the process
fr: Reconnectez le robot et relancez le processus

# update.error.robot_unexpected_disconnection_description
source: Error code #0004: The robot has been disconnected
fr: Code erreur #0004: Le robot s'est déconnecté de manière inattendue

# update.error.robot_unexpected_disconnection_instructions
source: Restart the robot using the "Emergency stop" card Reconnect the robot Restart the process
fr: Redémarrer le robot à l'aide de la carte \"Arrêt d'urgence\" Reconnectez le robot Relancez le processus

# update.error.unknown_error_description
source: Error code #0000: An unknown error has occurred
fr: Code erreur #0000: Une erreur inconnue s'est produite

# update.error.unknown_error_instructions
source: Please contact technical support
fr: Contactez le support technique

# update.error.update_process_not_available_description
source: Error code #0003: Update process not recognized or not available
fr: Code erreur #0003: Processus de mise à jour non disponible ou inconnu

# update.error.update_process_not_available_instructions
source: Please contact technical support
fr: Contactez le support technique

# update.error_title
source: Oops... Something went wrong.
fr: Oups… Une erreur est survenue.

# update.finished.launch_leka_app_button
source: Launch Leka App 🚀
fr: Lancer Leka app 🚀

# update.finished.robot_updated_successfully
source: Congrats! 🥳 Your robot is now up-to-date 🎉
fr: Bravo ! 🥳 Votre robot est maintenant à jour 🎉

# update.finished.update_another_robot_button
source: Update another robot
fr: Mettre à jour un autre robot

# update.rebooting.subtitle
source: Your robot will reboot in a few minutes
fr: Votre robot redémarrera dans quelques minutes

# update.rebooting.title
source: The update is being installed
fr: Installation de la mise à jour

# update.requirements.charging_base_green_led_text
source: The charging LED is green indicating the correct positioning on the base
fr: La LED de charge est verte indiquant le bon positionnement sur la base

# update.requirements.charging_base_plugged_text
source: The robot is placed on its base and the base is connected to the mains
fr: Le robot est posé sur son socle et le socle est branché au secteur

# update.requirements.instructions_text
source: To start the update, make sure that:
fr: Pour démarrer la mise à jour, assurez-vous que :

# update.requirements.robot_battery_minimum_level_text
source: The robot battery level is at least 30%
fr: Le niveau de batterie du robot est d'au moins 30%

# update.sending.instruction
source: Do not unplug your robot Do not remove it from its charging station Do not close the app
fr: Ne débranchez pas votre robot. Ne le sortez pas de son socle de recharge. Ne fermez pas l'application.

# update.sending.title
source: Sending update to the robot
fr: Envoi de la mise à jour vers le robot

# update.step_number
source: Step %@
fr: Étape %@
